app/views/messages/index.html.erb

        <td>
          <%= "Chat entre #{msg.chat.sender.first_name} y #{msg.chat.receiver.first_name}" %>
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        <td>
          <%= "#{msg.user.first_name} #{msg.user.last_name}" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]