app/views/messages/new.html.erb

SELECT "chats".* FROM "chats"
---
    <%= f.label :chat_id, "Chat" %><br>
    <%= f.select :chat_id, Chat.all.map { |c| ["Chat entre #{c.sender.first_name} y #{c.receiver.first_name}", c.id] } %>

SELECT "users".* FROM "users"
---
    <%= f.label :user_id, "Usuario que escribe" %><br>
    <%= f.select :user_id, User.all.map { |u| ["#{u.first_name} #{u.last_name}", u.id] } %>