app/views/messages/show.html.erb

SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

<p><strong>Chat:</strong> Chat entre <%= @message.chat.sender.first_name %> y <%= @message.chat.receiver.first_name %></p>
<p><strong>Usuario:</strong> <%= @message.user.first_name %> <%= @message.user.last_name %></p>