app/views/chats/new.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :sender_id, "Remitente" %><br>
    <%= f.select :sender_id, User.all.map { |u| [u.first_name + ' ' + u.last_name, u.id] } %>

SELECT "users".* FROM "users"
---
    <%= f.label :receiver_id, "Receptor" %><br>
    <%= f.select :receiver_id, User.all.map { |u| [u.first_name + ' ' + u.last_name, u.id] } %>