app/controllers/chats_controller.rb

  def index
    @chats = Chat.includes(:sender, :receiver).all
---
SELECT "chats".* FROM "chats"

  def show
    @chat = Chat.find(params[:id])
    @messages = @chat.messages.includes(:user)
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @chat = Chat.find_or_create_by(chat_params)
---
INSERT INTO "chats" ("sender_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sender_id", 1], ["receiver_id", 11], ["created_at", "2025-05-02 21:58:34.771889"], ["updated_at", "2025-05-02 21:58:34.771889"]]