app/controllers/messages_controller.rb

  def index
    @messages = Message.includes(:chat, :user).all
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" IN ($1, $2, $3, $4, $5, $6)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5], ["id", 6]]
SELECT "messages".* FROM "messages"
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5], ["id", 6], ["id", 7], ["id", 8], ["id", 9], ["id", 10]]

  def create
    @message = Message.new(message_params)
    if @message.chat && @message.user && @message.save
---
INSERT INTO "messages" ("chat_id", "user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["chat_id", 6], ["user_id", 1], ["body", "Hola Benjamin Cano"], ["created_at", "2025-05-02 21:58:55.553191"], ["updated_at", "2025-05-02 21:58:55.553191"]]