app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @chats = @user.chats.includes(:sender, :receiver)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "benjamincano@gmail.com"], ["first_name", "Benjamin"], ["last_name", "Cano"], ["created_at", "2025-05-02 21:58:26.493385"], ["updated_at", "2025-05-02 21:58:26.493385"]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "last_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_name", "GonzálezPere"], ["updated_at", "2025-05-16 23:51:39.606459"], ["id", 2]]